#+title: Writing notes

#+name: nlp_parse
#+caption: Example NLP parser
#+begin_src python :results output :exports result :var sent="Random"
from  nltk.parse.corenlp import CoreNLPParser

parser = CoreNLPParser()
parse = next(parser.raw_parse(sent))
parse.pretty_print()
#+end_src

#+name: sexp_parse
#+caption: Example NLP parser
#+begin_src python :results output :exports result :var sent="Random"
from nltk.parse.corenlp import CoreNLPParser
import nltk

parser = CoreNLPParser()
parse = next(parser.raw_parse(sent))


def rec(tree: nltk.tree.Tree, level: int) -> str:
    if len(tree) == 1 and type(tree[0]) != nltk.tree.Tree:
        return f"{'  ' * level}({tree.label()} \"{tree[0]}\")"

    else:
        result = f"{'  ' * level}({tree.label()}"
        for sub in tree:
            result += "\n"
            result += rec(sub, level + 1)


        result += ")"
        return result

print(rec(parse, 0))
#+end_src

*** =spacy=

#+caption: Installing language models
#+begin_src sh
python3 -m spacy download <model_name>
# for example (language model used in the documentation)
python3 -m spacy download en_core_web_sm
#+end_src

#+caption: Starting visualization
#+begin_src python
import spacy
from spacy import displacy

nlp = spacy.load("en_core_web_sm")
doc = nlp("This is a sentence.")
displacy.serve(doc, style="dep")
#+end_src

#+caption: Spacy plaintex visualization (require ~deplacy~ installation)
#+begin_src python :results output
import spacy
import deplacy

nlp = spacy.load("en_core_web_sm")
doc = nlp("Rex barks")
deplacy.render(doc)
#+end_src

#+RESULTS:
: Rex   PROPN <╗ compound
: barks NOUN  ═╝ ROOT

#+caption: Spacy graphviz visualization
#+begin_src python
import spacy
import deplacy
import os

nlp = spacy.load("en_core_web_sm")
doc = nlp("I like Nim a lot, but I'm also unsure of its' general direction.")
text = deplacy.dot(doc)

with open("/tmp/graph.dot", 'w') as file:
    file.write(text)

os.system("dot -Tpng -o /tmp/graph.png /tmp/graph.dot")
#+end_src

*** Constituency parsing

I swear I've seen an easier method  somewhere else, but from what I've seen
the  "best"  solution   for  getting  a  tree  structure  is   now  to  use
~CoreNLPParser~ solution. Setup is pretty annoying because it involves some
manual configuration and stuff.

First of all, you need to install  the =nltk= library itself. Then you need
to     download     the     Stanford    language     model     (?)     from
https://stanfordnlp.github.io/CoreNLP/download.html  --  "Download  CoreNLP
X.X.X". After you downloaded the zip file, extract it into some directory.

Then you  need to  /launch the NLP  server/ and only  after ensuring  it is
correctly  started you  can  run the  analysis script.  The  server can  be
launched using

#+caption: Start Stanford Core NLP server
#+begin_src python
from nltk.parse.corenlp import CoreNLPServer
import os

VERSION = "4.5.1"
STANFORD = os.path.join(
    os.path.dirname(os.path.realpath(__file__)),
    f"stanford-corenlp-{VERSION}"
)

# Create the server
server = CoreNLPServer(
   os.path.join(STANFORD, f"stanford-corenlp-{VERSION}.jar"),
   os.path.join(STANFORD, f"stanford-corenlp-{VERSION}-models.jar"),
)

# Start the server in the background
server.start()
#+end_src

This script assumes  you've unpacked the NLP archive in  the same directory
as the  script.

NOTE:  the ~CoreNLPServer~  fails to start  it will  give a
rather confusing error message in regards to the missing file path:

#+begin_example
Could not find stanford-corenlp-(\d+)\.(\d+)\.(\d+)\.jar jar file at stanford-corenlp-4.5.1
#+end_example

Despite  the use  of  regex-like  patterns it  does  not  search treat  the
arguments to  the server as  /directories to  search for/ --  arguments are
files and  checked as such. So  this message actually means  ~"no such file
'stanford-corenlp-4.5.1'"~.  I was  pretty confused  by this  error when  I
tried to pass unpacked directory itself to the constructor.

After server script has started and  you ensured it is running successfully
you can execute the NLP tree parser code itself.

#+caption: Example NLP parser
#+begin_src python :results output
from  nltk.parse.corenlp  import CoreNLPParser

parser = CoreNLPParser()
parse = next(parser.raw_parse("I put the book in the box on the table."))
parse.pretty_print()
#+end_src

#+RESULTS:
#+begin_example
                         ROOT
                          |
                          S
  ________________________|______________________________
 |                        VP                             |
 |    ____________________|________________              |
 |   |       |            PP               PP            |
 |   |       |         ___|____         ___|___          |
 NP  |       NP       |        NP      |       NP        |
 |   |    ___|___     |    ____|___    |    ___|____     |
PRP VBD  DT      NN   IN  DT       NN  IN  DT       NN   .
 |   |   |       |    |   |        |   |   |        |    |
 I  put the     book  in the      box  on the     table  .

#+end_example

NOTE: if you  get the "connection refused" error, check  the server startup
routine.

You can also execute  the code in the Jupyter notebook and  render it as an
SVG image, but you would need to have the =svgling= library installed.

#+caption: Parse NLP for Jupyter notebook display
#+begin_src python
from  nltk.parse.corenlp  import CoreNLPParser

parser = CoreNLPParser()
next(parser.raw_parse("I put the book in the box on the table."))
#+end_src

